app/views/areas/_form.html.erb

SELECT `catalogs`.* FROM `catalogs`
---

    <%=select("post", "catalog_id", Catalog.all.collect {|p| [ p.name, p.id ] })%>