app/views/items/_form.html.erb

SELECT `areas`.* FROM `areas`
---
  </div> -->
  <%=select("post", "area_id", Area.all.collect {|p| [ p.name, p.id ] })%>