app/controllers/areas_controller.rb

SELECT `areas`.* FROM `areas`
---
  def index
    @areas = Area.all

INSERT INTO `areas` (`name`, `catalog_id`, `created_at`, `updated_at`) VALUES ('mi nueva area', 33, '2019-03-15 03:38:14', '2019-03-15 03:38:14')
---
  def create
    @area = Area.new
    @area.name = area_params[:name]
    @area.catalog_id = params[:post][:catalog_id]
    respond_to do |format|
      if @area.save

UPDATE `areas` SET `catalog_id` = 29, `updated_at` = '2019-03-14 23:12:40' WHERE `areas`.`id` = 19
---
  def update
    respond_to do |format|
      if @area.update(area_params)

DELETE FROM `areas` WHERE `areas`.`id` = 42
---
  def destroy
    @area.destroy

SELECT  `areas`.* FROM `areas` WHERE `areas`.`id` = 43 LIMIT 1
---
    def set_area
      @area = Area.find(params[:id])