app/controllers/catalogs_controller.rb

  def index
    @catalogs = Catalog.all
---
SELECT `catalogs`.* FROM `catalogs`

  def create
    @catalog = Catalog.new(catalog_params)

    respond_to do |format|
      if @catalog.save
---
INSERT INTO `catalogs` (`name`, `catalog_id`, `created_at`, `updated_at`) VALUES ('Aida', 7, '2019-03-14 05:51:25', '2019-03-14 05:51:25')

  def update
    respond_to do |format|
      if @catalog.update(catalog_params)
---
UPDATE `catalogs` SET `name` = 'edit Apple', `updated_at` = '2019-03-14 04:27:47' WHERE `catalogs`.`id` = 1

  def destroy
    @catalog.destroy
---
DELETE FROM `catalogs` WHERE `catalogs`.`id` = 29

    def set_catalog
      @catalog = Catalog.find(params[:id])
---
SELECT  `catalogs`.* FROM `catalogs` WHERE `catalogs`.`id` = 22 LIMIT 1