app/controllers/items_controller.rb

INSERT INTO `items` (`name`, `area_id`, `created_at`, `updated_at`) VALUES ('Nuevo item', 36, '2019-03-15 04:26:31', '2019-03-15 04:26:31')
---
  def create
    @item = Item.new
    @item.name = item_params[:name]
    @item.area_id = params[:post][:area_id]
    respond_to do |format|
      if @item.save

UPDATE `items` SET `area_id` = 24, `updated_at` = '2019-03-14 20:02:21' WHERE `items`.`id` = 7
---
  def update
    respond_to do |format|
      if @item.update(item_params)

DELETE FROM `items` WHERE `items`.`id` = 25
---
  def destroy
    @item.destroy

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 14 LIMIT 1
---
    def set_item
      @item = Item.find(params[:id])