app/models/area.rb

SELECT `catalogs`.* FROM `catalogs` WHERE `catalogs`.`name` IS NULL
INSERT INTO `catalogs` (`name`, `created_at`, `updated_at`) VALUES ('GC - Hardware', '2019-03-15 04:18:05', '2019-03-15 04:18:05')
INSERT INTO `areas` (`name`, `catalog_id`, `created_at`, `updated_at`) VALUES ('Access Point', 63, '2019-03-15 16:38:34', '2019-03-15 16:38:34')
---
    def self.import(file)
    	CSV.foreach(file.path, headers: true) do |row|
        area = Area.new(name: row["name"])
        area.catalog_id = Catalog.where(name: row["Catalog"]).to_a.first.id
        area.save