app/models/catalog.rb

INSERT INTO `catalogs` (`name`, `created_at`, `updated_at`) VALUES ('GC - Software', '2019-03-15 00:54:56', '2019-03-15 00:54:56')
---
  def self.import(file)
  	CSV.foreach(file.path, headers: true) do |row|
  		Catalog.create! row.to_hash