app/models/item.rb

SELECT `areas`.* FROM `areas` WHERE `areas`.`name` = 'CPU'
INSERT INTO `items` (`name`, `area_id`, `created_at`, `updated_at`) VALUES ('Disco Duro', 45, '2019-03-15 15:05:56', '2019-03-15 15:05:56')
---
    def self.import(file)
    	CSV.foreach(file.path, headers: true) do |row|
        item = Item.new(name: row["name"])
        item.area_id = Area.where(name: row["Area"]).to_a.first.id
        item.save